"""
__المعادلات__
الاقواس ()
الاس **
الضرب والقسمه * /
الجمع والطرح + -
"""
#----|العمليات الحسابيه بالمتغيرات|----
# Exsample 1
x = 5
y = 10
print(x + y)# تجمع المتغيرين طبيعي
# Exsample 2
x = "10"
y = 2
print(x * y)# تكرر النص عدد الواي
# Exsample 3
x = "10"
y = "15"
print(x + y)# تجمعهم كنص 1015
# Exsample 4
"""
x = a# الاي يعتبرها البايثون متغير لان الماعليها علامة تنصيص
y = 2
print(x * y)# تجمعهم كنص 1015
"""
#----|انواع المتغيرات|----
"""
1- int ارقام صحيحة تبداء من الصفر
2- float ارقام كسرية
3- str اي نص سواء كان حروف او ارقام او رموز
4- bool تكون صح او خطاء
5- date تاريخ من مكتبه datetime
في كثير غيرهم ناخذهم بعدين
"""
# int
x = 3
# float
x = 4.21
# str
x = "abc 123 -+/()[]"
# bool
x = True
x = False
# date
import datetime
x = datetime.datetime.now()
print(x.year)